[
  {
    "title": "gpt prompt",
    "slug": "gpt",
    "asset_class": "gpt",
    "category": "gpt",
    "subcategory": "gpt",
    "content": "For each concept i shared with you\r\n\r\nI'd like you to complement this (XXX1, XXX2, and XXX3)\r\n<span class=\"explain\" data-explain=\"<b>XXX1</b><br>XXX2\">XXX3</span>\r\n\r\n\r\n\r\nXXX1 represent the full word, if there is no full word (meaning that I've already gave you the full word), XXX1 will be equal to XXX3\r\n\r\nXXX2 represent the definition, very concise, sharp, clear, but be careful, exhaustive and perfectly formulated.\r\n\r\nXXX3 represent the element directly taken from the list I gave you\r\nyou put the element betwen span\r\n\r\nExample: if I share you with a list of 2 concepts: Forward Guidance and LTRO, you should return\r\n\r\n\r\n<span class=\"explain\" data-explain=\"<b>Longer-term refinancing operations</b><br>ECB loans to banks with maturities longer than standard weekly operations (several years), usually against collateral, to provide more stable funding and support money-market functioning.\">LTRO</span>\r\n\r\n<span class=\"explain\" data-explain=\"<b>Forward Guidance</b><br>ECB communication strategy that guides future policy intentions (rates, QE path) to influence market expectations and long-term yields.\">Forward Guidance</span>",
    "last_update": "2025-11-14T20:39:20.983857+00:00"
  },
  {
    "title": "template",
    "slug": "template",
    "asset_class": "template",
    "category": "template",
    "subcategory": "template",
    "content": "<h2>Introduction</h2>\r\n<p></p>\r\n<span class=\"\" data-explain=\"\"></span>\r\n[CHART1]\r\n[CHART2]\r\n\r\n<hr>\r\n\r\n<h2>Long-Term Policy Rate Timeline</h2>\r\n<p></p>\r\n<div id=\"chart-ecb-policy-rates\" class=\"chart-block\"></div>\r\n\r\n<hr>\r\n\r\n<h2>Structural Policy Cycles (1999–2025)</h2>\r\n\r\n<h3>1. Pre-GFC Normalisation (1999–2007)</h3>\r\n\r\n\r\n[CHART2]\r\n\r\n<h3>5. Normalisation Attempt (2024–present)</h3>\r\n<p>\r\nWith inflation trending down, the ECB is transitioning toward a normalisation phase.\r\nForward guidance remains cautious, with decisions fully data-dependent and aligned\r\nwith medium-term inflation dynamics.\r\n</p>\r\n\r\n<hr>\r\n\r\n<h2>ECB Policy Tools</h2>\r\n\r\n<ul>\r\n  <li><strong>Main Refinancing Operations (MRO)</strong> – the central policy rate steering short-term liquidity.</li>\r\n  <li><strong>Deposit Facility Rate</strong> – the effective floor for Eurozone money markets.</li>\r\n  <li><strong>Marginal Lending Facility</strong> – the ceiling of the interest-rate corridor.</li>\r\n  <li><strong>TLTRO / LTRO programmes</strong> – long-term liquidity tools used extensively after 2011.</li>\r\n  <li><strong>APP & PEPP</strong> – balance-sheet tools for asset purchases during disinflationary periods.</li>\r\n  <li><strong>Forward Guidance</strong> – qualitative signalling introduced post-2011.</li>\r\n</ul>\r\n\r\n<hr>\r\n\r\n<h2></h2>\r\n\r\n<ul>\r\n  <li></li>\r\n  <li></li>\r\n </ul>\r\n\r\n<hr>",
    "last_update": "2025-11-14T13:35:31.000652+00:00"
  },
  {
    "title": "ECB Key Policy Rates",
    "slug": "rates/policy-rates/ecb",
    "asset_class": "rates",
    "category": "Policy Rates",
    "subcategory": "ECB",
    "content": "<h2>The ECB in Brief</h2>\r\n<ul>\r\n  <li>Established in 1998, the ECB is the monetary authority of the Eurozone.</li>\r\n  <li>Its mandate centres on price stability (2% inflation target).</li>\r\n  <li>Broader considerations include growth, unemployment, credit conditions, financial stress, and global shocks.</li>\r\n  <li>Its policy stance is transmitted through three rates: <span class=\"explain\" data-explain=\"<b>Deposit Facility</b> <br>The interest rate at which banks can place overnight deposits with the Eurosystem (floor).\">DF</span>, <span class=\"explain\" data-explain=\"<b>Main Refinancing Operations</b> <br>The rate at which banks can borrow weekly from the Eurosystem against collateral. Set above the (middle).\">MRO</span>, and <span class=\"explain\" data-explain=\"<b>Marginal Lending Facility</b> <br>The rate for overnight borrowing from the Eurosystem when banks need quick liquidity (ceiling).\">MLF</span>.</li>\r\n </ul>\r\n\r\n<h2>Historical Cycles (Since 1999)</h2>\r\n[CHART1]\r\n\r\n<h3>1. 1999-2000 – First tightening after euro launch</h3>\r\n<p>ECB hikes from 2.5% to 4.75% as euro-area growth accelerates, oil prices surge, money/credit grow fast and the euro is weak. Goal: establish anti-inflation credibility and contain medium-term inflation risks.</p>\r\n\r\n<h3>2. 2001-2003 – Dot-com bust and cautious cuts</h3>\r\n<p>ECB cuts from 4.75% to 2% as dot-com crash, global slowdown and 9/11 hit demand. Moves slower than the Fed because headline inflation is still pushed up by oil/tax effects.</p>\r\n\r\n<h3>3. 2003-2005 – Low and flat “Goldilocks”</h3>\r\n<p>Main refi held at 2%. Growth moderate, inflation near 2%, no acute financial stress. ECB sees this as a suitably accommodative, stable stance.</p>\r\n\r\n<h3>4. 2005-2007 – Pre-crisis normalisation</h3>\r\n<p>ECB hikes from 2% to 4% as growth is strong, oil and commodities rise, credit and money expand, and inflation runs above target. Aim: prevent overheating and de-anchoring of inflation expectations.</p>\r\n\r\n<h3>5. 2008-2009 – Global Financial Crisis</h3>\r\n<p>After a last hike to 4.25% in July 2008, ECB slashes to 1% after Lehman and deep recession. Launches full-allotment <span class=\"explain\" data-explain=\"<b>Longer-Term Refinancing Operations</b><br>ECB loans to banks with maturities longer than standard refinancing operations, against collateral, to provide stable funding and support money market functioning.\">LTROs</span> and bond purchases to stabilise banks, credit and inflation.</p>\r\n\r\n<h3>6. 2010-2011 – Sovereign crisis and policy mistake</h3>\r\n<p>ECB raises rates twice to 1.5% in 2011 on above-target inflation, while sovereign crisis in periphery explodes (Greece, Ireland, Portugal, then Italy and Spain later); partially offsets via <span class=\"explain\" data-explain=\"<b>Securities Markets Programme</b><br>Crisis era ECB programme to purchase selected public and private bonds, mainly stressed sovereigns, in secondary markets to repair market functioning and monetary policy transmission.\">SMP</span> bond buying. Quickly reverses hikes as crisis worsens – widely judged a mistake.</p>\r\n\r\n<h3>7. 2012-2014 – Draghi, OMT, forward guidance, NIRP</h3>\r\n<p>“Whatever it takes” and <span class=\"explain\" data-explain=\"<b>Outright Monetary Transactions</b><br>ECB backstop allowing conditional, potentially unlimited purchases of short maturity sovereign bonds of countries under an ESM programme, to safeguard the euro and transmission.\">OMT</span> backstop sovereigns and reduce fragmentation. ECB cuts rates to ~0, introduces <span class=\"explain\" data-explain=\"<b>Forward Guidance</b><br>Central bank communication that signals the likely future path of policy, conditional on the outlook, to steer market expectations and long term interest rates.\">forward guidance</span>, then <span class=\"explain\" data-explain=\"<b>Negative Interest Rate Policy</b><br>Policy of setting key policy rates below zero, especially the deposit facility, to push down money market rates, discourage excess reserves and support lending and inflation.\">NIRP</span> and targeted LTROs to fight recession and deflation risk.</p>\r\n\r\n<h3>8. 2015-2018 – QE and prolonged ultra-easy policy</h3>\r\n<p>ECB runs large-scale <span class=\"explain\" data-explain=\"<b>Asset Purchase Programme</b><br>Main ECB QE framework aggregating several bond purchase programmes, used to buy public and private assets to support credit conditions and push inflation back to target.\">APP</span> (<span class=\"explain\" data-explain=\"<b>Quantitative Easing</b><br>Large scale central bank purchases of securities financed by creating reserves, aimed at lowering long term yields, easing financial conditions and raising inflation towards target.\">QE</span>), keeps main refi at 0 and depo down to –0.40%, plus <span class=\"explain\" data-explain=\"<b>Targeted Longer-Term Refinancing Operations</b><br>Long term ECB loans to banks whose cost and amount depend on how much they lend to the real economy, designed to incentivise credit to firms and households.\">TLTROs</span>. Growth improves but inflation is still weak, so net purchases only stop at end-2018; rates remain at the lower bound.</p>\r\n\r\n<h3>9. 2019-2021 – Renewed easing + COVID shock</h3>\r\n<p>2019: depo cut to –0.50%, QE restarted, stronger forward guidance and reserve tiering as inflation undershoots. 2020–21: COVID recession → <span class=\"explain\" data-explain=\"<b>Pandemic Emergency Purchase Programme</b><br>Flexible QE programme launched in response to COVID 19, with a large envelope and freedom to skew purchases across time and countries to stabilise markets and prevent fragmentation.\">PEPP</span> and massive TLTROs while keeping rates at 0 / –0.50% to prevent financial and deflationary spiral.</p>\r\n\r\n<h3>10. 2022-2023 – Fastest hiking cycle</h3>\r\n<p>Post-COVID + energy shock push inflation into double digits. ECB ends net purchases and hikes from –0.50% to 4% on the depo rate (July 2022–Sept 2023) to re-anchor inflation expectations despite weak growth.</p>\r\n\r\n<h3>11. From 2024 – Disinflation and cautious easing</h3>\r\n<p>Inflation falls back towards target and growth is soft. From June 2024, ECB starts cutting from very restrictive levels and signals a gradual, data-dependent easing path to avoid over-tightening.</p>\r\n\r\n<h2>Key Observations & Takeaways</h2>\r\n\r\n<ul>\r\n  <li>The ECB has alternated between strict inflation-control logic and crisis-management logic.</li>\r\n  <li>The 2011 early hike remains one of the most debated decisions in ECB history.</li>\r\n  <li>The negative-rate regime (2014–2021) was unprecedented globally, shaping Eurozone banking margins and capital flows.</li>\r\n  <li>The 2022–2023 cycle was the fastest hiking sequence since the ECB’s creation.</li>\r\n  <li>€STR has become the effective anchor for short-term money markets and future monetary transmission.</li>\r\n</ul>",
    "last_update": "2025-11-14T20:48:31.506442+00:00"
  }
]